#+TITLE: GNU Emacs operating system settings
#+AUTHOR: Eric Haberstroh
#+EMAIL: gpg@erixpage.de
#+OPTIONS: toc:nil
#+MACRO: export-date (eval (format-time-string "%F %R %z" (current-time)))
#+MACRO: emacs-development-version (eval (substring (emacs-version) 0 14))
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup
#+HTML_HEAD: <style>pre.src{background:#343131;color:white;} </style>

- Created: 2021-03-31.
- Updated: *{{{export-date}}}*.
- Emacs Version: {{{emacs-development-version}}}.
- File history: https://github.com/pille1842/dotemacs/commits/conf21

  #+TOC: headlines 8 insert TOC here, with eight headline levels

** General design considerations
This configuration relies mainly on the [[https://github.com/jwiegley/use-package][use-package]] macro which makes creating a reproducible and consistent configuration much easier. This document lays out which packages are needed for a fully configured Emacs, and how each of these packages should in turn be fine-tuned to my liking. Use-package will ensure that all these packages are actually installed on the system from which this configuration is run.

This configuration has been tested on the following system:

#+begin_src emacs-lisp :tangle no :exports results
  (format "System type:   %s\nOS release:    %s\nEmacs version: %s"
          system-type
          operating-system-release
          emacs-version)
#+end_src

#+RESULTS:
: System type:   gnu/linux
: OS release:    5.8.0-48-generic
: Emacs version: 27.1

